#include "MQ-5.h"	

uchar t;
/**************************************************************************
功能描述：传感器检测
入口参数：无
返回值：无
 *************************************************************************/
void Sensor_Scan(void)
{
	 if(Sensor_IN == 0)        	//MQ-2传感器感应到可燃性气体浓度达到一定值，DO针脚输出低电平      
	 {
		 t=100;                     //上发数据1
		 P44=0;	             			//开启蜂鸣器
	 }
	 else                      	//MQ-2传感器感应到可燃性气体浓度低于一定值，DO针脚输出高电平 
	 {
		 t=0;											//上发数据0
		 P44=1;	       						//关闭蜂鸣器
	 }
}

/*********************************END FILE********************************************/	

